In [6]:
#install library
#!pip install scikit-learn 
#!pip install matplotlib

In [10]:
import matplotlib.pyplot as plt
import pandas as pd
import os
#print("Matplotlib installed successfully!")

In [11]:
os.listdir()

['.ipynb_checkpoints',
 'car data.csv',
 'marital status.csv',
 'nasdaq100.csv',
 'Salary Data.csv',
 'Untitled.ipynb']

In [21]:
df=pd.read_csv('nasdaq100.csv',sep=';')
df

        Date  Starting (USD)  Ending (USD)
0   01.01.24           16800         16500
1   01.12.23           15900         16100
2   01.11.23           15800         15300
3   01.10.23           16100         16200
4   01.09.23           16300         15700
5   01.08.23           16800         16400
6   01.07.23           15900         16200
7   01.06.23           15800         15500
8   01.05.23           16150         16100
9   01.04.23           16300         15800
10  01.03.23           16200         16200
11  01.02.23           16300         15700

In [22]:
#null value check
df.isnull().sum()

Date              0
Starting (USD)    0
Ending (USD)      0
dtype: int64

In [23]:
#Date column delete
## column delete axis=1 , row delete axis=0

df.drop('Date',axis=1)

    Starting (USD)  Ending (USD)
0            16800         16500
1            15900         16100
2            15800         15300
3            16100         16200
4            16300         15700
5            16800         16400
6            15900         16200
7            15800         15500
8            16150         16100
9            16300         15800
10           16200         16200
11           16300         15700